;;; russian-colemak-dh.el --- ЙЦУКЕН quail layout for Colemak-DH users -*- lexical-binding: t; coding: utf-8 -*-
;; Copyright (C) 2025 by cookieconsent

(quail-define-package
 "Russian-Colemak-DH" "Russian-Colemak-DH"  "ColRU-" t
 "Russian-Colemak-DH"
 nil t t t t nil nil nil nil nil t)

(quail-define-rules
 ("q" ["й"])  ("Q" ["Й"])
 ("w" ["ц"])  ("W" ["Ц"])
 ("f" ["у"])  ("F" ["У"])
 ("p" ["к"])  ("P" ["К"])
 ("b" ["е"])  ("B" ["Е"])
 ("j" ["н"])  ("J" ["Н"])
 ("l" ["г"])  ("L" ["Г"])
 ("u" ["ш"])  ("U" ["Ш"])
 ("y" ["щ"])  ("Y" ["Щ"])
 (";" ["з"])  (":" ["З"])
 ("[" ["х"])  ("{" ["Х"])
 ("]" ["ъ"])  ("}" ["Ъ"])

 ("a" ["ф"])  ("A" ["Ф"])
 ("r" ["ы"])  ("R" ["Ы"])
 ("s" ["в"])  ("S" ["В"])
 ("t" ["а"])  ("T" ["А"])
 ("g" ["п"])  ("G" ["П"])
 ("m" ["р"])  ("M" ["Р"])
 ("n" ["о"])  ("N" ["О"])
 ("e" ["л"])  ("E" ["Л"])
 ("i" ["д"])  ("I" ["Д"])
 ("o" ["ж"])  ("O" ["Ж"])
 ("'" ["э"])  ("\"" ["Э"])

 ("x" ["я"])  ("X" ["Я"])
 ("c" ["ч"])  ("C" ["Ч"])
 ("d" ["с"])  ("D" ["С"])
 ("v" ["м"])  ("V" ["М"])
 ("z" ["и"])  ("Z" ["И"])
 ("k" ["т"])  ("K" ["Т"])
 ("h" ["ь"])  ("H" ["Ь"])
 ("," ["б"])  ("<" ["Б"])
 ("." ["ю"])  (">" ["Ю"])
 ("/" ["."])  ("?" ["?"]))

(provide 'russian-colemak-dh)
